d3vv3/open-motorcycle-intercom/sdkconfig.defaults
# OMI - ESP32-S31 SDK Configuration Defaults
# These settings are applied on first build or after `idf.py fullclean`

# Target
CONFIG_IDF_TARGET="esp32s31"

# Serial flasher
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# FreeRTOS - optimize for low latency
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# CPU frequency - balance performance and power
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Logging - enable timestamps
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_TIMESTAMP_SOURCE_RTOS=y

# WiFi/ESP-NOW (required for mesh)
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=n

# Bluetooth Classic A2DP sink and AVRCP phone controls
CONFIG_BT_ENABLED=y
CONFIG_BT_CONTROLLER_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_CLASSIC_ENABLED=y
CONFIG_BT_BLE_ENABLED=n
CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=y
CONFIG_BT_ALLOCATION_FROM_SPIRAM_FIRST=y
CONFIG_BT_A2DP_ENABLE=y
CONFIG_BT_A2DP_USE_EXTERNAL_CODEC=n
CONFIG_BT_AVRCP_CT_COVER_ART_ENABLED=n
CONFIG_BT_HFP_ENABLE=y
CONFIG_BT_HFP_CLIENT_ENABLE=y
CONFIG_BT_HFP_AUDIO_DATA_PATH_HCI=y
CONFIG_BT_HFP_USE_EXTERNAL_CODEC=n
CONFIG_BT_HFP_WBS_ENABLE=y
CONFIG_BT_CTRL_BR_EDR_MAX_SYNC_CONN=1
CONFIG_BT_CTRL_BR_EDR_SCO_DATA_PATH_HCI=y

# UART Bridge to nRF52840 (for future use)
CONFIG_UART_ISR_IN_IRAM=y

# Power management - enable for battery optimization
CONFIG_PM_ENABLE=y
CONFIG_PM_DFS_INIT_AUTO=y

# Timer - high resolution for TDMA timing
CONFIG_ESP_TIMER_TASK_STACK_SIZE=4096
CONFIG_ESP_TIMER_SUPPORTS_ISR_DISPATCH_METHOD=y

# Memory optimization
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=3072
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096

# Function CoreBoard-1 PSRAM: explicit capability allocations only.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_BOOT_HW_INIT=y
CONFIG_SPIRAM_MEMTEST=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=n
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_USE_MALLOC=n
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=n
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=n
CONFIG_SPIRAM_ALLOW_NOINIT_SEG_EXTERNAL_MEMORY=n
CONFIG_SPIRAM_XIP_FROM_PSRAM=n

# Watchdog
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# Compiler optimization
CONFIG_COMPILER_OPTIMIZATION_PERF=y
